-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Oct 25, 2020 at 08:52 PM
-- Server version: 10.4.13-MariaDB
-- PHP Version: 7.4.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `petshopdb`
--

DELIMITER $$
--
-- Procedures
--
CREATE DEFINER=`root`@`localhost` PROCEDURE `initiate_data` ()  Begin
DELETE FROM ordersdetail;
DELETE FROM ordershead;
DELETE FROM products;
DELETE FROM users;
DELETE FROM prodtypes;
DELETE FROM orderstates;
DELETE FROM payment;
DELETE FROM shipment;

INSERT INTO `orderstates` (`STATECODE`, `STATENAME`) VALUES
(1, 'Κατατέθηκε'),
(2, 'Σε Επεξεργασία'),
(3, 'Απεστάλη'),
(4, 'Ολοκληρωμένη');

INSERT INTO `payment` (`ID`, `FULLDESCRIPTION`, `SHORTDESCRIPTION`) VALUES
(1, 'Πιστωτική, χρεωστική ή προπληρωμένη κάρτα online', 'Κάρτα'),
(2, 'Τραπεζική κατάθεση', 'Κατάθεση');

INSERT INTO `shipment` (`ID`, `FULLDESCRIPTION`, `SHORTDESCRIPTION`) VALUES
(1, 'Παραλαβή από το κατάστημα', 'Κατάστημα'),
(2, 'Παράδοση με δική μας μεταφορική ή courier', 'Our courier'),
(3, 'Παράδοση με μεταφορική ή courier της επιλογής σας', 'Other courier');

INSERT INTO `prodtypes` (`TYPECODE`, `TYPENAME`) VALUES
(10, 'Τροφή'),
(11, 'Λιχουδιά'),
(12, 'Κολάρο'),
(13, 'Ρούχο'),
(14, 'Παιχνίδι');

INSERT INTO `users` (`USERCODE`, `PASSWORD`, `FIRSTNAME`, `LASTNAME`, `MOBILE`, `EMAIL`, `ADMIN`, `ADRESS`, `TK`, `CITY`, `NOMOS`, `BIRTHDATE`) VALUES
(11, 'puser1234', 'Γιώργος', 'Πεκος', '6982314567', 'user@mail.com', b'0', 'Αρμαγου 41', 61100, 'Αθηνα', 'Ν. Αττικής', '1992-01-02'),
(12, 'padmin1234', 'Τακης', 'Τσαλτιδης', '2310789456', 'admin@mail.com', b'1', 'Κιτσοκρανια 3', 61200, 'Ζαλογγο', 'Ν. Ιωαννίνων', '2000-12-01'),
(14, '12345678', 'Δημος', 'Χιωλικιδης', '6981234567', 'mdime40000@live.com', b'0', 'κολοκοτρωνη 7', 61100, 'Αθηνα', 'Ν. Αττικής', '1997-12-01'),
(15, '12345678', 'Μιχάλης', 'Προβίδης', '6991234567', 'provialdo@hotmail.com', b'0', 'Κιτσου 79', 61900, 'Βολος', 'Ν. Μαγνησίας', '1980-01-29'),
(21, '12345678', 'Μπαμπης', 'Σουγιας', '6991234567', 'shortKnive@live.com', b'0', 'Καραισκακη 52', 61800, 'Κομοτηνή', 'Ν. Ροδόπης', '1989-05-05'),
(22, '12345678', 'Μαρια', 'Βελωνη', '6991234567', 'needle@live.com', b'0', 'Δημοκρατιας 9', 63000, 'Ματαλα', 'Ν. Ηρακλείου', '2000-04-07'),
(24, '12345678', 'Αννα', 'Κουτιδου', '6991234567', 'koutidou@mail.com', b'0', 'Σαλαμινας 79', 61900, 'Βόλος', 'Ν. Μαγνησίας', '2005-01-01'),
(28, '12345678', 'Ελενη', 'Μουρτακη', '6987654321', 'e.mourtakh@f', b'0', 'Δευκελειας 154', 61100, 'Αθηνα', 'Ν. Αττικής', '2002-02-13'),
(29, '12345678', 'Στεφανια', 'Γατου', '6987654321', 'stef@gmail.com', b'0', 'Αντιστασεως 68', 61100, 'Αθηνα', 'Ν. Αττικής', '2004-04-16'),
(30, '12345678', 'Σια', 'Μιαουνη', '6987654321', 'miaou@live.gr', b'0', 'Εγνατιας 116', 61100, 'Αθηνα', 'Ν. Αττικής', '2005-01-23'),
(31, '12345678', 'Δημητρης', 'Ποντικας', '6987654321', 'mouse@gmail.com', b'0', 'Βασ. Ολγας 251', 61100, 'Αθηνα', 'Ν. Αττικής', '1999-01-15'),
(33, '12345678', 'Στελιος', 'Κοκωνης', '6987654321', 'stel@live.com', b'0', 'Πατησιων 56', 61100, 'Αθηνα', 'Ν. Αττικής', '2001-01-16');


INSERT INTO `products` (`PRODCODE`, `PRODNAME`, `TYPECODE_FK`, `PRODDESCRIPTION`, `PRODPIC`, `PRODSTOCK`, `PRODVALUE`) VALUES
(9, 'Doggex Σνακ', 11, 'Σνακ σκύλου με Ω3, Ω4, Ω5 λιπαρά, κατάλληλα για ενήλικους σκύλους ως συμπλήρωμα διατροφής. ', 'doggex.jpg', 19, 7.6),
(10, 'Σκυλο-Μπαλάκι', 14, 'Παιχνίδι σκύλου μπάλα κόκκινη με μπλε διακοσμημένη με γατούλες, 16cm', 'skilobalex.jpg', 8, 5.3),
(11, 'Γιδοκονσέρβα', 10, 'Κονσέρβα σκύλου, πλήρες εκλεκτό γεύμα με κομμάτια από αρνάκι άσπρο και παχύ', 'gidokonserva.jpeg', 1, 14),
(12, 'Μοσχαροκροκέτες', 10, 'Κροκέτες με μοσχάρι για μικρόσωμες ράτσες με μέτρια δραστηριότητα, ηλικίας 1- 6 ετών.', 'mosxarokroketes.jpg', 22, 18.9),
(13, 'Redneck', 12, 'Περιλαίμιο σκύλου, κόκκινο με σχέδιο γάτα που κυνηγά σκύλο, xs, 15-23cm', 'redneck.jpg', 31, 4.9),
(14, 'Κοκκαλέξ', 14, 'Παιχνίδι σκύλου κόκκαλο μπλε, 12 cm, από μαλακό και ανθεκτικό υλικό.', 'kokkalex.jpg', 44, 2.5),
(15, 'Βρακέξ (20 τχ)', 13, 'Πάνα-βρακάκι σκύλου, με μεγάλη απορροφητικότητα και άρωμα δυόσμου, s, 20 τεμάχια', 'vrakeks.jpg', 55, 7.7),
(16, 'Mini sticks', 11, 'Mini sticks, λιχουδιά από μοσχάρι με χαμηλά λιπαρά και υψηλή θερμιδική αξία.', 'miniSticks.jpg', 1, 6),
(17, 'Πουλοβερεξ Σκύλου', 13, 'Ζεστό πουλόβερ σκύλου, ροζ πουά με στρας και σχέδιο κεραυνό, xl.', 'pullover.jpg', 1, 6.1),
(18, 'Τουμπανοκροκέτες (4kg)', 10, 'Κροκέτες ολοκληρωμένη και γευστική τροφή με κοτόπουλο και λαχανικά για ενήλικους σκύλους.', 'toumpanokroketes.jpg', 8, 28.7),
(19, 'Φτηνο-κολαρέξ', 12, 'Περιλαίμιο από υψηλής ποιότητας νάιλον με πλάτος 2,2cm και μήκος 39cm.', 'nailonPerilemio.jpg', 50, 2.1),
(20, 'Τουρμποκροκέτες (5 kg)', 10, 'Κροκέτες με βοδινό και μοσχάρι, πλήρης τροφή για σκύλους άνω των δέκα κιλών.', 'turbokroketes.jpg', 1, 49),
(21, 'Σκυλοπαιχνίδι Καρδιά', 14, 'Παιχνιδι για συναισθηματικούς σκύλους.', 'paixnidiSkilouKardia.jpeg', 1, 0.9),
(22, 'Σκυλοπαιχνίδι Σκαντζόχοιρος', 14, 'Ενας πολυτιμος πλην ακανθώδης φίλος για το κατοικίδιο σας.', 'PaixnidiSkilouSkantzoxoiros.jpeg', 30, 1.35),
(23, 'Mocdog', 10, 'Συνδυάζει καφέ εσπρέσσο με χοιρινή κροκέτα. Για σκύλους υποτονικούς που δεν ξυπνούν. Απαλό άρωμα.', 'mocdog.jpg', 35, 11),
(24, 'Skylo-news', 14, 'Είτε το πιστεύετε είτε όχι προσομοιώνει τον ήχο πραγματικής εφημερίδας. Καλό;', 'dogpaper.jpg', 15, 2.1);

INSERT INTO `ordershead` (`ORDERCODE`, `USERCODE_FK`, `ORDERDATE`, `STATE_FK`, `TOTALAMOUNT`, `TOTALVALUE`, `SHIPMENT_FK`, `PAYMENT_FK`, `COMMENT`) VALUES
(23, 11, '2020-03-05 02:26:25', 1, 10, 41.4, 2, 1, 'Visa, ωρες παραλαβης 6-8 μ.μ'),
(24, 11, '2020-03-18 02:27:37', 3, 3, 19.7, 1, 2, 'Αρ. Λογ:213/1234567'),
(25, 11, '2020-03-24 02:27:57', 2, 4, 75.6, 1, 1, NULL),
(26, 12, '2020-03-24 02:28:29', 1, 6, 13.6, 2, 2, 'Ωρες παραλαβής:6-9 μ.μ, Αρ.Λογ:979/123456'),
(27, 12, '2020-03-24 02:29:00', 4, 3, 13, 3, 2, 'Ωρες παραλαβής:6-9 μ.μ, Αρ.Λογ:979/123456,Ασσος Courier'),
(28, 11, '2020-03-24 02:29:49', 1, 10, 90.7, 1, 1, NULL),
(29, 14, '2020-03-25 00:01:15', 1, 7, 69.1, 3, 2, NULL),
(30, 14, '2020-03-25 00:01:31', 1, 1, 2.1, 2, 2, NULL),
(31, 14, '2020-03-25 00:01:50', 1, 5, 15.7, 1, 1, NULL),
(32, 12, '2020-03-25 00:02:18', 1, 6, 87.7, 2, 1, 'Ωρες παραλαβής:6-9 μ.μ'),
(33, 11, '2020-03-25 00:02:59', 1, 7, 26.2, 3, 1, NULL),
(34, 11, '2020-03-25 00:03:34', 1, 5, 13, 1, 2, 'Αρ. Λογ:213/1299567'),
(35, 12, '2020-03-25 00:24:37', 1, 6, 42.55, 2, 1, 'Ωρες παραλαβής:9-11 π.μ'),
(36, 12, '2020-03-25 00:24:50', 1, 1, 2.1, 1, 1, NULL),
(37, 14, '2020-03-25 00:25:24', 1, 4, 15.1, 3, 1, 'Ωρες παραλαβής:1-9 μ.μ,Βητα Courier'),
(38, 14, '2020-03-25 00:26:10', 1, 1, 1.35, 2, 2, NULL),
(39, 14, '2020-03-25 00:26:19', 1, 1, 4.9, 3, 2, NULL),
(40, 14, '2020-03-25 00:26:40', 1, 5, 36.1, 2, 2, NULL),
(41, 14, '2020-03-25 00:26:57', 1, 1, 1.35, 2, 1, 'Ωρες παραλαβής:12-3 μ.μ'),
(42, 11, '2020-03-25 00:27:23', 1, 4, 153.1, 1, 1, NULL),
(43, 11, '2020-03-25 00:28:02', 1, 1, 11, 1, 1, NULL),
(44, 11, '2020-04-06 00:28:19', 1, 4, 106.2, 1, 2, 'Αρ. Λογ:212/1277567'),
(45, 11, '2020-04-08 00:28:48', 1, 4, 39, 2, 1, 'Ωρες παραλαβής:7-9 μ.μ'),
(46, 11, '2020-04-10 00:29:18', 1, 2, 21.7, 1, 1, NULL),
(47, 15, '2020-04-12 04:40:30', 1, 5, 15.9, 2, 2, 'Ωρες παραλαβής:7-9 μ.μ, Αρ.Λογ:999/166456'),
(48, 15, '2020-04-13 04:41:02', 1, 13, 89, 1, 1, NULL),
(49, 12, '2020-04-13 22:17:56', 1, 4, 25.45, 1, 1, NULL),
(51, 11, '2020-04-14 20:43:15', 1, 5, 29.4, 3, 2, NULL),
(52, 11, '2020-04-18 18:04:31', 1, 2, 13.1, 3, 1, 'Ωρες παραλαβής:3-9 μ.μ,Ητα Courier'),
(53, 11, '2020-04-18 18:04:58', 1, 4, 24.7, 2, 2, 'Ωρες παραλαβής:5-7 μ.μ, Αρ.Λογ:179/123459'),
(54, 11, '2020-04-26 18:42:28', 1, 3, 4.8, 2, 1, 'Ωρες παραλαβής:6-10 μ.μ'),
(55, 11, '2020-04-26 18:42:54', 1, 8, 228.7, 1, 1, NULL),
(56, 15, '2020-04-26 18:44:19', 1, 8, 86.9, 1, 1, NULL),
(57, 15, '2020-04-26 18:44:47', 1, 6, 19.8, 3, 2, NULL),
(58, 14, '2020-04-26 18:45:40', 1, 5, 33, 3, 1, 'Ωρες παραλαβής:8-9 μ.μ,Βητα Courier'),
(59, 14, '2020-04-26 18:46:21', 1, 4, 64.8, 2, 1, 'Ωρες παραλαβής:8-10 μ.μ'),
(60, 14, '2020-04-26 18:46:37', 1, 2, 7, 1, 2, NULL),
(61, 14, '2020-04-26 18:47:07', 1, 4, 51.9, 1, 1, NULL),
(62, 11, '2020-04-26 18:47:46', 1, 4, 6.15, 3, 2, 'Ωρες παραλαβής:6-9 μ.μ,Βητα Courier'),
(63, 11, '2020-04-26 18:48:17', 1, 11, 93.9, 1, 1, NULL),
(64, 12, '2020-10-08 23:07:11', 1, 7, 38.25, 2, 1, 'Ωρες παραλαβής:4-6 μ.μ'),
(65, 12, '2020-10-09 20:43:44', 1, 4, 25.45, 1, 2, 'Αρ. Λογ:313/1234567'),
(66, 12, '2020-10-19 21:03:09', 1, 3, 4.05, 2, 2, 'τεστ'),
(67, 12, '2020-10-19 21:03:41', 1, 1, 2.1, 1, 1, ''),
(68, 11, '2020-10-24 15:35:29', 1, 4, 25.45, 2, 2, 'geia sou dhmo'),
(69, 12, '2020-10-25 16:35:49', 1, 4, 25.45, 1, 1, ''),
(70, 33, '2020-10-25 19:02:39', 1, 6, 59.2, 2, 2, ''),
(71, 33, '2020-10-25 19:03:09', 1, 5, 16.4, 3, 1, ''),
(72, 33, '2020-10-25 19:03:56', 1, 7, 53.5, 3, 1, 'Ωρες παραλαβής:8-9 μ.μ,Βητα Courier'),
(73, 29, '2020-10-25 19:10:43', 1, 7, 145.9, 1, 1, ''),
(74, 29, '2020-10-25 19:10:58', 1, 4, 25.45, 1, 2, 'Αρ. Λογ:313/1234567'),
(75, 29, '2020-10-25 19:12:56', 1, 4, 10.85, 1, 1, ''),
(76, 21, '2020-10-25 19:18:18', 1, 16, 122.8, 2, 1, 'Ωρες παραλαβής:4-6 μ.μ'),
(77, 21, '2020-10-25 19:18:34', 1, 1, 2.1, 1, 1, ''),
(78, 21, '2020-10-25 19:18:46', 1, 10, 81.05, 3, 2, 'Ωρες παραλαβής:6-9 μ.μ,Βητα Courier'),
(79, 11, '2020-10-25 19:19:04', 1, 4, 25.45, 1, 1, '');

INSERT INTO `ordersdetail` (`ORDERCODE_FK`, `PRODCODE_FK`, `PRODQUANTITY`, `ORDERPRODVALUE`) VALUES
(23, 21, 4, 3.6),
(23, 22, 2, 2.7),
(23, 23, 3, 33),
(23, 24, 1, 2.1),
(24, 15, 1, 7.7),
(24, 16, 2, 12),
(25, 12, 4, 75.6),
(26, 17, 1, 6.1),
(26, 19, 1, 2.1),
(26, 22, 4, 5.4),
(27, 16, 1, 6),
(27, 17, 1, 6.1),
(27, 21, 1, 0.9),
(28, 22, 2, 2.7),
(28, 23, 8, 88),
(29, 11, 2, 28),
(29, 16, 1, 6),
(29, 23, 3, 33),
(29, 24, 1, 2.1),
(30, 24, 1, 2.1),
(31, 13, 2, 9.8),
(31, 14, 2, 5),
(31, 21, 1, 0.9),
(32, 12, 4, 75.6),
(32, 16, 1, 6),
(32, 17, 1, 6.1),
(33, 13, 2, 9.8),
(33, 22, 4, 5.4),
(33, 23, 1, 11),
(34, 17, 1, 6.1),
(34, 19, 1, 2.1),
(34, 22, 2, 2.7),
(34, 24, 1, 2.1),
(35, 15, 1, 7.7),
(35, 18, 1, 28.7),
(35, 22, 3, 4.05),
(35, 24, 1, 2.1),
(36, 19, 1, 2.1),
(37, 16, 1, 6),
(37, 17, 1, 6.1),
(37, 21, 1, 0.9),
(37, 24, 1, 2.1),
(38, 22, 1, 1.35),
(39, 13, 1, 4.9),
(40, 16, 2, 12),
(40, 23, 2, 22),
(40, 24, 1, 2.1),
(41, 22, 1, 1.35),
(42, 17, 1, 6.1),
(42, 20, 3, 147),
(43, 23, 1, 11),
(44, 17, 1, 6.1),
(44, 19, 1, 2.1),
(44, 20, 2, 98),
(45, 9, 2, 15.2),
(45, 12, 1, 18.9),
(45, 13, 1, 4.9),
(46, 11, 1, 14),
(46, 15, 1, 7.7),
(47, 16, 2, 12),
(47, 21, 2, 1.8),
(47, 24, 1, 2.1),
(48, 10, 5, 26.5),
(48, 14, 3, 7.5),
(48, 23, 5, 55),
(49, 22, 1, 1.35),
(49, 23, 2, 22),
(49, 24, 1, 2.1),
(51, 9, 2, 15.2),
(51, 16, 1, 6),
(51, 17, 1, 6.1),
(51, 24, 1, 2.1),
(52, 23, 1, 11),
(52, 24, 1, 2.1),
(53, 22, 2, 2.7),
(53, 23, 2, 22),
(54, 22, 2, 2.7),
(54, 24, 1, 2.1),
(55, 12, 4, 75.6),
(55, 17, 1, 6.1),
(55, 20, 3, 147),
(56, 11, 5, 70),
(56, 13, 1, 4.9),
(56, 16, 2, 12),
(57, 10, 3, 15.9),
(57, 21, 2, 1.8),
(57, 24, 1, 2.1),
(58, 9, 3, 22.8),
(58, 14, 1, 2.5),
(58, 15, 1, 7.7),
(59, 10, 1, 5.3),
(59, 18, 2, 57.4),
(59, 19, 1, 2.1),
(60, 17, 1, 6.1),
(60, 21, 1, 0.9),
(61, 12, 1, 18.9),
(61, 23, 3, 33),
(62, 22, 3, 4.05),
(62, 24, 1, 2.1),
(63, 13, 2, 9.8),
(63, 16, 2, 12),
(63, 17, 1, 6.1),
(63, 23, 6, 66),
(64, 21, 2, 1.8),
(64, 22, 1, 1.35),
(64, 23, 3, 33),
(64, 24, 1, 2.1),
(65, 22, 1, 1.35),
(65, 23, 2, 22),
(65, 24, 1, 2.1),
(66, 22, 3, 4.05),
(67, 24, 1, 2.1),
(68, 22, 1, 1.35),
(68, 23, 2, 22),
(68, 24, 1, 2.1),
(69, 22, 1, 1.35),
(69, 23, 2, 22),
(69, 24, 1, 2.1),
(70, 10, 2, 10.6),
(70, 15, 1, 7.7),
(70, 17, 2, 12.2),
(70, 18, 1, 28.7),
(71, 9, 1, 7.6),
(71, 14, 1, 2.5),
(71, 19, 3, 6.3),
(72, 9, 1, 7.6),
(72, 11, 2, 28),
(72, 13, 2, 9.8),
(72, 16, 1, 6),
(72, 24, 1, 2.1),
(73, 13, 1, 4.9),
(73, 17, 2, 12.2),
(73, 18, 1, 28.7),
(73, 19, 1, 2.1),
(73, 20, 2, 98),
(74, 22, 1, 1.35),
(74, 23, 2, 22),
(74, 24, 1, 2.1),
(75, 15, 1, 7.7),
(75, 21, 2, 1.8),
(75, 22, 1, 1.35),
(76, 9, 1, 7.6),
(76, 10, 5, 26.5),
(76, 11, 1, 14),
(76, 12, 2, 37.8),
(76, 13, 3, 14.7),
(76, 14, 1, 2.5),
(76, 15, 1, 7.7),
(76, 16, 2, 12),
(77, 24, 1, 2.1),
(78, 22, 3, 4.05),
(78, 23, 7, 77),
(79, 22, 1, 1.35),
(79, 23, 2, 22),
(79, 24, 1, 2.1);
end$$

DELIMITER ;

-- --------------------------------------------------------

--
-- Table structure for table `ordersdetail`
--

CREATE TABLE `ordersdetail` (
  `ORDERCODE_FK` int(11) NOT NULL,
  `PRODCODE_FK` int(11) NOT NULL,
  `PRODQUANTITY` int(11) NOT NULL,
  `ORDERPRODVALUE` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ordersdetail`
--

INSERT INTO `ordersdetail` (`ORDERCODE_FK`, `PRODCODE_FK`, `PRODQUANTITY`, `ORDERPRODVALUE`) VALUES
(23, 21, 4, 3.6),
(23, 22, 2, 2.7),
(23, 23, 3, 33),
(23, 24, 1, 2.1),
(24, 15, 1, 7.7),
(24, 16, 2, 12),
(25, 12, 4, 75.6),
(26, 17, 1, 6.1),
(26, 19, 1, 2.1),
(26, 22, 4, 5.4),
(27, 16, 1, 6),
(27, 17, 1, 6.1),
(27, 21, 1, 0.9),
(28, 22, 2, 2.7),
(28, 23, 8, 88),
(29, 11, 2, 28),
(29, 16, 1, 6),
(29, 23, 3, 33),
(29, 24, 1, 2.1),
(30, 24, 1, 2.1),
(31, 13, 2, 9.8),
(31, 14, 2, 5),
(31, 21, 1, 0.9),
(32, 12, 4, 75.6),
(32, 16, 1, 6),
(32, 17, 1, 6.1),
(33, 13, 2, 9.8),
(33, 22, 4, 5.4),
(33, 23, 1, 11),
(34, 17, 1, 6.1),
(34, 19, 1, 2.1),
(34, 22, 2, 2.7),
(34, 24, 1, 2.1),
(35, 15, 1, 7.7),
(35, 18, 1, 28.7),
(35, 22, 3, 4.05),
(35, 24, 1, 2.1),
(36, 19, 1, 2.1),
(37, 16, 1, 6),
(37, 17, 1, 6.1),
(37, 21, 1, 0.9),
(37, 24, 1, 2.1),
(38, 22, 1, 1.35),
(39, 13, 1, 4.9),
(40, 16, 2, 12),
(40, 23, 2, 22),
(40, 24, 1, 2.1),
(41, 22, 1, 1.35),
(42, 17, 1, 6.1),
(42, 20, 3, 147),
(43, 23, 1, 11),
(44, 17, 1, 6.1),
(44, 19, 1, 2.1),
(44, 20, 2, 98),
(45, 9, 2, 15.2),
(45, 12, 1, 18.9),
(45, 13, 1, 4.9),
(46, 11, 1, 14),
(46, 15, 1, 7.7),
(47, 16, 2, 12),
(47, 21, 2, 1.8),
(47, 24, 1, 2.1),
(48, 10, 5, 26.5),
(48, 14, 3, 7.5),
(48, 23, 5, 55),
(49, 22, 1, 1.35),
(49, 23, 2, 22),
(49, 24, 1, 2.1),
(51, 9, 2, 15.2),
(51, 16, 1, 6),
(51, 17, 1, 6.1),
(51, 24, 1, 2.1),
(52, 23, 1, 11),
(52, 24, 1, 2.1),
(53, 22, 2, 2.7),
(53, 23, 2, 22),
(54, 22, 2, 2.7),
(54, 24, 1, 2.1),
(55, 12, 4, 75.6),
(55, 17, 1, 6.1),
(55, 20, 3, 147),
(56, 11, 5, 70),
(56, 13, 1, 4.9),
(56, 16, 2, 12),
(57, 10, 3, 15.9),
(57, 21, 2, 1.8),
(57, 24, 1, 2.1),
(58, 9, 3, 22.8),
(58, 14, 1, 2.5),
(58, 15, 1, 7.7),
(59, 10, 1, 5.3),
(59, 18, 2, 57.4),
(59, 19, 1, 2.1),
(60, 17, 1, 6.1),
(60, 21, 1, 0.9),
(61, 12, 1, 18.9),
(61, 23, 3, 33),
(62, 22, 3, 4.05),
(62, 24, 1, 2.1),
(63, 13, 2, 9.8),
(63, 16, 2, 12),
(63, 17, 1, 6.1),
(63, 23, 6, 66),
(64, 21, 2, 1.8),
(64, 22, 1, 1.35),
(64, 23, 3, 33),
(64, 24, 1, 2.1),
(65, 22, 1, 1.35),
(65, 23, 2, 22),
(65, 24, 1, 2.1),
(66, 22, 3, 4.05),
(67, 24, 1, 2.1),
(68, 22, 1, 1.35),
(68, 23, 2, 22),
(68, 24, 1, 2.1),
(69, 22, 1, 1.35),
(69, 23, 2, 22),
(69, 24, 1, 2.1),
(70, 10, 2, 10.6),
(70, 15, 1, 7.7),
(70, 17, 2, 12.2),
(70, 18, 1, 28.7),
(71, 9, 1, 7.6),
(71, 14, 1, 2.5),
(71, 19, 3, 6.3),
(72, 9, 1, 7.6),
(72, 11, 2, 28),
(72, 13, 2, 9.8),
(72, 16, 1, 6),
(72, 24, 1, 2.1),
(73, 13, 1, 4.9),
(73, 17, 2, 12.2),
(73, 18, 1, 28.7),
(73, 19, 1, 2.1),
(73, 20, 2, 98),
(74, 22, 1, 1.35),
(74, 23, 2, 22),
(74, 24, 1, 2.1),
(75, 15, 1, 7.7),
(75, 21, 2, 1.8),
(75, 22, 1, 1.35),
(76, 9, 1, 7.6),
(76, 10, 5, 26.5),
(76, 11, 1, 14),
(76, 12, 2, 37.8),
(76, 13, 3, 14.7),
(76, 14, 1, 2.5),
(76, 15, 1, 7.7),
(76, 16, 2, 12),
(77, 24, 1, 2.1),
(78, 22, 3, 4.05),
(78, 23, 7, 77),
(79, 22, 1, 1.35),
(79, 23, 2, 22),
(79, 24, 1, 2.1);

-- --------------------------------------------------------

--
-- Table structure for table `ordershead`
--

CREATE TABLE `ordershead` (
  `ORDERCODE` int(11) NOT NULL,
  `USERCODE_FK` int(11) NOT NULL,
  `ORDERDATE` datetime NOT NULL,
  `STATE_FK` int(11) NOT NULL,
  `TOTALAMOUNT` int(11) DEFAULT NULL,
  `TOTALVALUE` double DEFAULT NULL,
  `SHIPMENT_FK` smallint(6) NOT NULL,
  `PAYMENT_FK` smallint(6) NOT NULL,
  `COMMENT` varchar(60) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ordershead`
--

INSERT INTO `ordershead` (`ORDERCODE`, `USERCODE_FK`, `ORDERDATE`, `STATE_FK`, `TOTALAMOUNT`, `TOTALVALUE`, `SHIPMENT_FK`, `PAYMENT_FK`, `COMMENT`) VALUES
(23, 11, '2020-03-05 02:26:25', 1, 10, 41.4, 2, 1, 'Visa, ωρες παραλαβης 6-8 μ.μ'),
(24, 11, '2020-03-18 02:27:37', 3, 3, 19.7, 1, 2, 'Αρ. Λογ:213/1234567'),
(25, 11, '2020-03-24 02:27:57', 2, 4, 75.6, 1, 1, NULL),
(26, 12, '2020-03-24 02:28:29', 1, 6, 13.6, 2, 2, 'Ωρες παραλαβής:6-9 μ.μ, Αρ.Λογ:979/123456'),
(27, 12, '2020-03-24 02:29:00', 4, 3, 13, 3, 2, 'Ωρες παραλαβής:6-9 μ.μ, Αρ.Λογ:979/123456,Ασσος Courier'),
(28, 11, '2020-03-24 02:29:49', 1, 10, 90.7, 1, 1, NULL),
(29, 14, '2020-03-25 00:01:15', 1, 7, 69.1, 3, 2, NULL),
(30, 14, '2020-03-25 00:01:31', 1, 1, 2.1, 2, 2, NULL),
(31, 14, '2020-03-25 00:01:50', 1, 5, 15.7, 1, 1, NULL),
(32, 12, '2020-03-25 00:02:18', 1, 6, 87.7, 2, 1, 'Ωρες παραλαβής:6-9 μ.μ'),
(33, 11, '2020-03-25 00:02:59', 1, 7, 26.2, 3, 1, NULL),
(34, 11, '2020-03-25 00:03:34', 1, 5, 13, 1, 2, 'Αρ. Λογ:213/1299567'),
(35, 12, '2020-03-25 00:24:37', 1, 6, 42.55, 2, 1, 'Ωρες παραλαβής:9-11 π.μ'),
(36, 12, '2020-03-25 00:24:50', 1, 1, 2.1, 1, 1, NULL),
(37, 14, '2020-03-25 00:25:24', 1, 4, 15.1, 3, 1, 'Ωρες παραλαβής:1-9 μ.μ,Βητα Courier'),
(38, 14, '2020-03-25 00:26:10', 1, 1, 1.35, 2, 2, NULL),
(39, 14, '2020-03-25 00:26:19', 1, 1, 4.9, 3, 2, NULL),
(40, 14, '2020-03-25 00:26:40', 1, 5, 36.1, 2, 2, NULL),
(41, 14, '2020-03-25 00:26:57', 1, 1, 1.35, 2, 1, 'Ωρες παραλαβής:12-3 μ.μ'),
(42, 11, '2020-03-25 00:27:23', 1, 4, 153.1, 1, 1, NULL),
(43, 11, '2020-03-25 00:28:02', 1, 1, 11, 1, 1, NULL),
(44, 11, '2020-04-06 00:28:19', 1, 4, 106.2, 1, 2, 'Αρ. Λογ:212/1277567'),
(45, 11, '2020-04-08 00:28:48', 1, 4, 39, 2, 1, 'Ωρες παραλαβής:7-9 μ.μ'),
(46, 11, '2020-04-10 00:29:18', 1, 2, 21.7, 1, 1, NULL),
(47, 15, '2020-04-12 04:40:30', 1, 5, 15.9, 2, 2, 'Ωρες παραλαβής:7-9 μ.μ, Αρ.Λογ:999/166456'),
(48, 15, '2020-04-13 04:41:02', 1, 13, 89, 1, 1, NULL),
(49, 12, '2020-04-13 22:17:56', 1, 4, 25.45, 1, 1, NULL),
(51, 11, '2020-04-14 20:43:15', 1, 5, 29.4, 3, 2, NULL),
(52, 11, '2020-04-18 18:04:31', 1, 2, 13.1, 3, 1, 'Ωρες παραλαβής:3-9 μ.μ,Ητα Courier'),
(53, 11, '2020-04-18 18:04:58', 1, 4, 24.7, 2, 2, 'Ωρες παραλαβής:5-7 μ.μ, Αρ.Λογ:179/123459'),
(54, 11, '2020-04-26 18:42:28', 1, 3, 4.8, 2, 1, 'Ωρες παραλαβής:6-10 μ.μ'),
(55, 11, '2020-04-26 18:42:54', 1, 8, 228.7, 1, 1, NULL),
(56, 15, '2020-04-26 18:44:19', 1, 8, 86.9, 1, 1, NULL),
(57, 15, '2020-04-26 18:44:47', 1, 6, 19.8, 3, 2, NULL),
(58, 14, '2020-04-26 18:45:40', 1, 5, 33, 3, 1, 'Ωρες παραλαβής:8-9 μ.μ,Βητα Courier'),
(59, 14, '2020-04-26 18:46:21', 1, 4, 64.8, 2, 1, 'Ωρες παραλαβής:8-10 μ.μ'),
(60, 14, '2020-04-26 18:46:37', 1, 2, 7, 1, 2, NULL),
(61, 14, '2020-04-26 18:47:07', 1, 4, 51.9, 1, 1, NULL),
(62, 11, '2020-04-26 18:47:46', 1, 4, 6.15, 3, 2, 'Ωρες παραλαβής:6-9 μ.μ,Βητα Courier'),
(63, 11, '2020-04-26 18:48:17', 1, 11, 93.9, 1, 1, NULL),
(64, 12, '2020-10-08 23:07:11', 1, 7, 38.25, 2, 1, 'Ωρες παραλαβής:4-6 μ.μ'),
(65, 12, '2020-10-09 20:43:44', 1, 4, 25.45, 1, 2, 'Αρ. Λογ:313/1234567'),
(66, 12, '2020-10-19 21:03:09', 1, 3, 4.05, 2, 2, 'τεστ'),
(67, 12, '2020-10-19 21:03:41', 1, 1, 2.1, 1, 1, ''),
(68, 11, '2020-10-24 15:35:29', 1, 4, 25.45, 2, 2, 'geia sou dhmo'),
(69, 12, '2020-10-25 16:35:49', 1, 4, 25.45, 1, 1, ''),
(70, 33, '2020-10-25 19:02:39', 1, 6, 59.2, 2, 2, ''),
(71, 33, '2020-10-25 19:03:09', 1, 5, 16.4, 3, 1, ''),
(72, 33, '2020-10-25 19:03:56', 1, 7, 53.5, 3, 1, 'Ωρες παραλαβής:8-9 μ.μ,Βητα Courier'),
(73, 29, '2020-10-25 19:10:43', 1, 7, 145.9, 1, 1, ''),
(74, 29, '2020-10-25 19:10:58', 1, 4, 25.45, 1, 2, 'Αρ. Λογ:313/1234567'),
(75, 29, '2020-10-25 19:12:56', 1, 4, 10.85, 1, 1, ''),
(76, 21, '2020-10-25 19:18:18', 1, 16, 122.8, 2, 1, 'Ωρες παραλαβής:4-6 μ.μ'),
(77, 21, '2020-10-25 19:18:34', 1, 1, 2.1, 1, 1, ''),
(78, 21, '2020-10-25 19:18:46', 1, 10, 81.05, 3, 2, 'Ωρες παραλαβής:6-9 μ.μ,Βητα Courier'),
(79, 11, '2020-10-25 19:19:04', 1, 4, 25.45, 1, 1, '');

-- --------------------------------------------------------

--
-- Table structure for table `orderstates`
--

CREATE TABLE `orderstates` (
  `STATECODE` int(11) NOT NULL,
  `STATENAME` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `orderstates`
--

INSERT INTO `orderstates` (`STATECODE`, `STATENAME`) VALUES
(1, 'Κατατέθηκε'),
(2, 'Σε Επεξεργασία'),
(3, 'Απεστάλη'),
(4, 'Ολοκληρωμένη');

-- --------------------------------------------------------

--
-- Table structure for table `payment`
--

CREATE TABLE `payment` (
  `ID` smallint(6) NOT NULL,
  `FULLDESCRIPTION` varchar(50) NOT NULL,
  `SHORTDESCRIPTION` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `payment`
--

INSERT INTO `payment` (`ID`, `FULLDESCRIPTION`, `SHORTDESCRIPTION`) VALUES
(1, 'Πιστωτική, χρεωστική ή προπληρωμένη κάρτα online', 'Κάρτα'),
(2, 'Τραπεζική κατάθεση', 'Κατάθεση');

-- --------------------------------------------------------

--
-- Table structure for table `prodtypes`
--

CREATE TABLE `prodtypes` (
  `TYPECODE` int(11) NOT NULL,
  `TYPENAME` varchar(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `prodtypes`
--

INSERT INTO `prodtypes` (`TYPECODE`, `TYPENAME`) VALUES
(10, 'Τροφή'),
(11, 'Λιχουδιά'),
(12, 'Κολάρο'),
(13, 'Ρούχο'),
(14, 'Παιχνίδι');

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `PRODCODE` int(11) NOT NULL,
  `PRODNAME` varchar(30) NOT NULL,
  `TYPECODE_FK` int(11) NOT NULL,
  `PRODDESCRIPTION` varchar(249) DEFAULT NULL,
  `PRODPIC` varchar(200) DEFAULT NULL,
  `PRODSTOCK` int(11) NOT NULL,
  `PRODVALUE` double DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`PRODCODE`, `PRODNAME`, `TYPECODE_FK`, `PRODDESCRIPTION`, `PRODPIC`, `PRODSTOCK`, `PRODVALUE`) VALUES
(9, 'Doggex Σνακ', 11, 'Σνακ σκύλου με Ω3, Ω4, Ω5 λιπαρά, κατάλληλα για ενήλικους σκύλους ως συμπλήρωμα διατροφής. ', 'doggex.jpg', 19, 7.6),
(10, 'Σκυλο-Μπαλάκι', 14, 'Παιχνίδι σκύλου μπάλα κόκκινη με μπλε διακοσμημένη με γατούλες, 16cm', 'skilobalex.jpg', 8, 5.3),
(11, 'Γιδοκονσέρβα', 10, 'Κονσέρβα σκύλου, πλήρες εκλεκτό γεύμα με κομμάτια από αρνάκι άσπρο και παχύ', 'gidokonserva.jpeg', 1, 14),
(12, 'Μοσχαροκροκέτες', 10, 'Κροκέτες με μοσχάρι για μικρόσωμες ράτσες με μέτρια δραστηριότητα, ηλικίας 1- 6 ετών.', 'mosxarokroketes.jpg', 22, 18.9),
(13, 'Redneck', 12, 'Περιλαίμιο σκύλου, κόκκινο με σχέδιο γάτα που κυνηγά σκύλο, xs, 15-23cm', 'redneck.jpg', 31, 4.9),
(14, 'Κοκκαλέξ', 14, 'Παιχνίδι σκύλου κόκκαλο μπλε, 12 cm, από μαλακό και ανθεκτικό υλικό.', 'kokkalex.jpg', 44, 2.5),
(15, 'Βρακέξ (20 τχ)', 13, 'Πάνα-βρακάκι σκύλου, με μεγάλη απορροφητικότητα και άρωμα δυόσμου, s, 20 τεμάχια', 'vrakeks.jpg', 55, 7.7),
(16, 'Mini sticks', 11, 'Mini sticks, λιχουδιά από μοσχάρι με χαμηλά λιπαρά και υψηλή θερμιδική αξία.', 'miniSticks.jpg', 1, 6),
(17, 'Πουλοβερεξ Σκύλου', 13, 'Ζεστό πουλόβερ σκύλου, ροζ πουά με στρας και σχέδιο κεραυνό, xl.', 'pullover.jpg', 1, 6.1),
(18, 'Τουμπανοκροκέτες (4kg)', 10, 'Κροκέτες ολοκληρωμένη και γευστική τροφή με κοτόπουλο και λαχανικά για ενήλικους σκύλους.', 'toumpanokroketes.jpg', 8, 28.7),
(19, 'Φτηνο-κολαρέξ', 12, 'Περιλαίμιο από υψηλής ποιότητας νάιλον με πλάτος 2,2cm και μήκος 39cm.', 'nailonPerilemio.jpg', 50, 2.1),
(20, 'Τουρμποκροκέτες (5 kg)', 10, 'Κροκέτες με βοδινό και μοσχάρι, πλήρης τροφή για σκύλους άνω των δέκα κιλών.', 'turbokroketes.jpg', 1, 49),
(21, 'Σκυλοπαιχνίδι Καρδιά', 14, 'Παιχνιδι για συναισθηματικούς σκύλους.', 'paixnidiSkilouKardia.jpeg', 1, 0.9),
(22, 'Σκυλοπαιχνίδι Σκαντζόχοιρος', 14, 'Ενας πολυτιμος πλην ακανθώδης φίλος για το κατοικίδιο σας.', 'PaixnidiSkilouSkantzoxoiros.jpeg', 30, 1.35),
(23, 'Mocdog', 10, 'Συνδυάζει καφέ εσπρέσσο με χοιρινή κροκέτα. Για σκύλους υποτονικούς που δεν ξυπνούν. Απαλό άρωμα.', 'mocdog.jpg', 35, 11),
(24, 'Skylo-news', 14, 'Είτε το πιστεύετε είτε όχι προσομοιώνει τον ήχο πραγματικής εφημερίδας. Καλό;', 'dogpaper.jpg', 15, 2.1);

-- --------------------------------------------------------

--
-- Table structure for table `shipment`
--

CREATE TABLE `shipment` (
  `ID` smallint(6) NOT NULL,
  `FULLDESCRIPTION` varchar(50) NOT NULL,
  `SHORTDESCRIPTION` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `shipment`
--

INSERT INTO `shipment` (`ID`, `FULLDESCRIPTION`, `SHORTDESCRIPTION`) VALUES
(1, 'Παραλαβή από το κατάστημα', 'Κατάστημα'),
(2, 'Παράδοση με δική μας μεταφορική ή courier', 'Our courier'),
(3, 'Παράδοση με μεταφορική ή courier της επιλογής σας', 'Other courier');

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `USERCODE` int(11) NOT NULL,
  `PASSWORD` varchar(20) NOT NULL,
  `FIRSTNAME` varchar(20) NOT NULL,
  `LASTNAME` varchar(20) NOT NULL,
  `MOBILE` varchar(30) DEFAULT NULL,
  `EMAIL` varchar(30) NOT NULL,
  `ADMIN` bit(1) NOT NULL,
  `ADRESS` varchar(30) DEFAULT NULL,
  `TK` int(11) DEFAULT NULL,
  `CITY` varchar(30) DEFAULT NULL,
  `NOMOS` varchar(30) DEFAULT NULL,
  `BIRTHDATE` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`USERCODE`, `PASSWORD`, `FIRSTNAME`, `LASTNAME`, `MOBILE`, `EMAIL`, `ADMIN`, `ADRESS`, `TK`, `CITY`, `NOMOS`, `BIRTHDATE`) VALUES
(11, 'puser1234', 'Γιώργος', 'Πεκος', '6982314567', 'user@mail.com', b'0', 'Αρμαγου 41', 61100, 'Αθηνα', 'Ν. Αττικής', '1992-01-02'),
(12, 'padmin1234', 'Τακης', 'Τσαλτιδης', '2310789456', 'admin@mail.com', b'1', 'Κιτσοκρανια 3', 61200, 'Ζαλογγο', 'Ν. Ιωαννίνων', '2000-12-01'),
(14, '12345678', 'Δημος', 'Χιωλικιδης', '6981234567', 'mdime40000@live.com', b'0', 'κολοκοτρωνη 7', 61100, 'Αθηνα', 'Ν. Αττικής', '1997-12-01'),
(15, '12345678', 'Μιχάλης', 'Προβίδης', '6991234567', 'provialdo@hotmail.com', b'0', 'Κιτσου 79', 61900, 'Βολος', 'Ν. Μαγνησίας', '1980-01-29'),
(21, '12345678', 'Μπαμπης', 'Σουγιας', '6991234567', 'shortKnive@live.com', b'0', 'Καραισκακη 52', 61800, 'Κομοτηνή', 'Ν. Ροδόπης', '1989-05-05'),
(22, '12345678', 'Μαρια', 'Βελωνη', '6991234567', 'needle@live.com', b'0', 'Δημοκρατιας 9', 63000, 'Ματαλα', 'Ν. Ηρακλείου', '2000-04-07'),
(24, '12345678', 'Αννα', 'Κουτιδου', '6991234567', 'koutidou@mail.com', b'0', 'Σαλαμινας 79', 61900, 'Βόλος', 'Ν. Μαγνησίας', '2005-01-01'),
(28, '12345678', 'Ελενη', 'Μουρτακη', '6987654321', 'e.mourtakh@f', b'0', 'Δευκελειας 154', 61100, 'Αθηνα', 'Ν. Αττικής', '2002-02-13'),
(29, '12345678', 'Στεφανια', 'Γατου', '6987654321', 'stef@gmail.com', b'0', 'Αντιστασεως 68', 61100, 'Αθηνα', 'Ν. Αττικής', '2004-04-16'),
(30, '12345678', 'Σια', 'Μιαουνη', '6987654321', 'miaou@live.gr', b'0', 'Εγνατιας 116', 61100, 'Αθηνα', 'Ν. Αττικής', '2005-01-23'),
(31, '12345678', 'Δημητρης', 'Ποντικας', '6987654321', 'mouse@gmail.com', b'0', 'Βασ. Ολγας 251', 61100, 'Αθηνα', 'Ν. Αττικής', '1999-01-15'),
(33, '12345678', 'Στελιος', 'Κοκωνης', '6987654321', 'stel@live.com', b'0', 'Πατησιων 56', 61100, 'Αθηνα', 'Ν. Αττικής', '2001-01-16');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `ordersdetail`
--
ALTER TABLE `ordersdetail`
  ADD PRIMARY KEY (`ORDERCODE_FK`,`PRODCODE_FK`),
  ADD KEY `PRODCODE_FK` (`PRODCODE_FK`);

--
-- Indexes for table `ordershead`
--
ALTER TABLE `ordershead`
  ADD PRIMARY KEY (`ORDERCODE`),
  ADD KEY `USERCODE_FK` (`USERCODE_FK`),
  ADD KEY `ordershead_payment_1` (`PAYMENT_FK`),
  ADD KEY `ordershead_shipment_1` (`SHIPMENT_FK`);

--
-- Indexes for table `orderstates`
--
ALTER TABLE `orderstates`
  ADD PRIMARY KEY (`STATECODE`);

--
-- Indexes for table `payment`
--
ALTER TABLE `payment`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `prodtypes`
--
ALTER TABLE `prodtypes`
  ADD PRIMARY KEY (`TYPECODE`);

--
-- Indexes for table `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`PRODCODE`),
  ADD KEY `TYPECODE_PRODUCTS_PRODTYPES` (`TYPECODE_FK`);

--
-- Indexes for table `shipment`
--
ALTER TABLE `shipment`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`USERCODE`),
  ADD UNIQUE KEY `EMAIL` (`EMAIL`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `ordershead`
--
ALTER TABLE `ordershead`
  MODIFY `ORDERCODE` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;

--
-- AUTO_INCREMENT for table `payment`
--
ALTER TABLE `payment`
  MODIFY `ID` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `prodtypes`
--
ALTER TABLE `prodtypes`
  MODIFY `TYPECODE` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;

--
-- AUTO_INCREMENT for table `products`
--
ALTER TABLE `products`
  MODIFY `PRODCODE` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- AUTO_INCREMENT for table `shipment`
--
ALTER TABLE `shipment`
  MODIFY `ID` smallint(6) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `USERCODE` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=34;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `ordersdetail`
--
ALTER TABLE `ordersdetail`
  ADD CONSTRAINT `ordersdetail_ibfk_1` FOREIGN KEY (`ORDERCODE_FK`) REFERENCES `ordershead` (`ORDERCODE`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `ordersdetail_ibfk_2` FOREIGN KEY (`PRODCODE_FK`) REFERENCES `products` (`PRODCODE`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `ordershead`
--
ALTER TABLE `ordershead`
  ADD CONSTRAINT `ordershead_ibfk_1` FOREIGN KEY (`USERCODE_FK`) REFERENCES `users` (`USERCODE`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `ordershead_payment_1` FOREIGN KEY (`PAYMENT_FK`) REFERENCES `payment` (`ID`) ON DELETE NO ACTION ON UPDATE NO ACTION,
  ADD CONSTRAINT `ordershead_shipment_1` FOREIGN KEY (`SHIPMENT_FK`) REFERENCES `shipment` (`ID`) ON DELETE NO ACTION ON UPDATE NO ACTION;

--
-- Constraints for table `products`
--
ALTER TABLE `products`
  ADD CONSTRAINT `TYPECODE_PRODUCTS_PRODTYPES` FOREIGN KEY (`TYPECODE_FK`) REFERENCES `prodtypes` (`TYPECODE`) ON DELETE NO ACTION ON UPDATE NO ACTION;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
